zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc54xxx/pinctrl/LPC54016JBD100-pinctrl.h
#define EMC_EMC_D13_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 6) /* PIO1_29 */
#define FC7_RXD_SDA_MOSI_DATA_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 1) /* PIO1_29 */
#define GPIO_PIO129_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT4_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT5_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define PINT_PINT7_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 0) /* PIO1_29 */
#define SCT0_IN0_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN1_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN2_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN3_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN4_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN5_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SCT0_IN6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 3) /* PIO1_29 */
#define SDIF_SD_D6_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 2) /* PIO1_29 */
#define USB1_FRAME_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 5) /* PIO1_29 */
#define USB1_PORTPWRN_PIO1_29 IOCON_MUX(61, IOCON_TYPE_D, 4) /* PIO1_29 */
#define ADC0_TRIG1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define ADC0_TRIG2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG10_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG11_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG12_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG13_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG14_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG15_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG16_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG17_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG18_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG19_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG20_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG21_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG22_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG23_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG24_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG25_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG26_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG27_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG28_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG29_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG7_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG8_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define DMA0_TRIG9_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define EMC_EMC_D14_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 6) /* PIO1_30 */
#define FC7_TXD_SCL_MISO_WS_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 1) /* PIO1_30 */
#define GPIO_PIO130_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define PINT_PINT7_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 0) /* PIO1_30 */
#define SCT0_IN0_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN1_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN2_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN3_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN4_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN5_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SCT0_IN6_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 3) /* PIO1_30 */
#define SDIF_SD_D7_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 2) /* PIO1_30 */
#define USB1_LEDN_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 5) /* PIO1_30 */
#define USB1_OVERCURRENTN_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 4) /* PIO1_30 */
#define ADC0_TRIG1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define ADC0_TRIG2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define CTIMER0_MATCH2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 3) /* PIO1_31 */
#define DMA0_TRIG0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG10_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG11_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG12_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG13_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG14_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG15_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG16_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG17_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG18_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG19_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG20_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG21_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG22_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG23_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG24_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG25_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG26_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG27_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG28_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG29_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG4_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG5_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG7_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG8_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define DMA0_TRIG9_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define EMC_EMC_D15_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 6) /* PIO1_31 */
#define FC8_CTS_SDA_SSEL0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 5) /* PIO1_31 */
#define GPIO_PIO131_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define MCLK_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 1) /* PIO1_31 */
#define PINT_PINT0_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT1_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT2_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT3_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT4_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT5_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define PINT_PINT7_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 0) /* PIO1_31 */
#define SCT0_OUT6_PIO1_31 IOCON_MUX(63, IOCON_TYPE_D, 4) /* PIO1_31 */

#endif
